FuzzySetTheory.org
#+TITLE: Fuzzy Set Theory
#+LATEX_HEADER: \input{preamble.tex}
#+EXPORT_FILE_NAME: latex/FuzzySetTheory/FuzzySetTheory.tex

* Fuzzy sets-basic definitions

  If $X$ is a collection of objects denoted generically by $x$, then a *fuzzy set*
  $\tilde{A}$ in $X$ is a set of ordered pairs
  \begin{equation*}
  \tilde{A}=\lb(x,\mu_{\tilde{A}}(x))|x\in X\rb
  \end{equation*}
  $\mu_{\tilde{A}}(x)$ is called the *membership function* or *grade of membership*
  of $x$ in $\tilde{A}$ that maps $X$ to the membership space $M$

  The *support* of a fuzzy set $\tilde{A}$, $S(\tilde{A})$ i sthe crisp set of all
  $x\in X$ s.t. $\mu_{\tilde{A}}(x)>0$

  The (crisp) set of elements that belong to the fuzzy set $\tilde{A}$ at least
  to the degree $\alpha$ is called the $\alpha\textbf{-level set}$
  \begin{equation*}
  A_\alpha=\lb x\in X|\mu_{\tilde{A}}(x)\ge \alpha\rb
  \end{equation*}
