latex/FuzzySetTheory/FuzzySetTheory.tex
% Created 2019-07-08 一 10:02
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\input{preamble.tex}
\author{wu}
\date{\today}
\title{Fuzzy Set Theory}
\hypersetup{
 pdfauthor={wu},
 pdftitle={Fuzzy Set Theory},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.2 (Org mode 9.2.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Fuzzy sets-basic definitions}
\label{sec:org31e9e8f}

If \(X\) is a collection of objects denoted generically by \(x\), then a \textbf{fuzzy set}
\(\tilde{A}\) in \(X\) is a set of ordered pairs
\begin{equation*}
\tilde{A}=\lb(x,\mu_{\tilde{A}}(x))|x\in X\rb
\end{equation*}
\(\mu_{\tilde{A}}(x)\) is called the \textbf{membership function} or \textbf{grade of membership}
of \(x\) in \(\tilde{A}\) that maps \(X\) to the membership space \(M\)

The \textbf{support} of a fuzzy set \(\tilde{A}\), \(S(\tilde{A})\) i sthe crisp set of all
\(x\in X\) s.t. \(\mu_{\tilde{A}}(x)>0\)

The (crisp) set of elements that belong to the fuzzy set \(\tilde{A}\) at least
to the degree \(\alpha\) is called the \(\alpha\textbf{-level set}\)
\begin{equation*}
A_\alpha=\lb x\in X|\mu_{\tilde{A}}(x)\ge \alpha\rb
\end{equation*}
\end{document}